{
  "backend/main.mo": "Motoko backend storing reminders, wellness logs, exercise logs, and user profiles with access‑controlled CRUD operations.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, descriptions, affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "JSON-formatted list of short summaries for all frontend source files.",
  "frontend/index.css": "Tailwind CSS theme file defining light/dark design tokens and global base styles.",
  "frontend/index.html": "Root HTML page setting metadata and mounting the React application.",
  "frontend/src/App.tsx": "Main React app orchestrating auth, profile setup, navigation, and view rendering.",
  "frontend/src/components/EmptyState.tsx": "Reusable empty‑state component with icon, message, and optional action.",
  "frontend/src/components/LoadingState.tsx": "Skeleton-based loading placeholder component with adjustable rows.",
  "frontend/src/features/auth/AuthLanding.tsx": "Marketing landing page introducing Alex Health with hero content and login CTA.",
  "frontend/src/features/auth/ProfileSetupDialog.tsx": "Dialog for entering and saving a user's name during initial profile setup using a mutation hook.",
  "frontend/src/features/dashboard/DashboardView.tsx": "Displays weekly exercise metrics and today's workouts using fetched logs and derived statistics.",
  "frontend/src/features/dates/DatePickerControl.tsx": "Provides a popover date picker with a quick 'Today' button to change the selected date.",
  "frontend/src/features/dates/dateUtils.ts": "Utility functions for converting dates to bigint timestamps and generating date ranges.",
  "frontend/src/features/exercise/exerciseMetrics.ts": "Calculates aggregate exercise metrics such as total minutes, workout count, active days, and average intensity.",
  "frontend/src/features/layout/AppLayout.tsx": "Main app layout with navigation, user greeting, logout handling, and reminder banner wrapper.",
  "frontend/src/features/logging/DailyLogsView.tsx": "Shows daily exercise and wellness logs for a selected date with tabbed categories and a date picker.",
  "frontend/src/features/logging/ExerciseLogForm.tsx": "Form dialog to add or edit an exercise log, validating inputs and submitting via mutation hooks.",
  "frontend/src/features/logging/ExerciseLogSection.tsx": "Displays exercise logs for a day with add, edit, and delete actions using a form modal.",
  "frontend/src/features/logging/WellnessLogForm.tsx": "Form modal for creating or editing wellness logs with category-specific labels and mutation handling.",
  "frontend/src/features/logging/WellnessLogSection.tsx": "Shows wellness logs for a category with options to add, edit, or delete entries via a form.",
  "frontend/src/features/progress/ExerciseChart.tsx": "Builds a bar chart of daily exercise minutes over a 7- or 30-day range using Recharts.",
  "frontend/src/features/progress/ProgressView.tsx": "Main progress dashboard with range selection and tabs for exercise, hydration, and sleep charts.",
  "frontend/src/features/progress/WellnessChart.tsx": "Placeholder wellness chart that displays static guidance text for category trends.",
  "frontend/src/features/reminders/DueRemindersBanner.tsx": "Shows active due reminders as dismissible alerts, resetting dismissals daily.",
  "frontend/src/features/reminders/ReminderForm.tsx": "Form modal for creating or editing reminders, including title, category, and scheduled time.",
  "frontend/src/features/reminders/RemindersList.tsx": "Renders a list of reminders with controls to toggle active status, edit, or delete, and opens an edit form when needed.",
  "frontend/src/features/reminders/RemindersView.tsx": "Displays the reminders page, fetching reminders and showing loading, empty, or list states, with a button to open the creation form.",
  "frontend/src/features/reminders/reminderUtils.ts": "Provides a utility to determine if a reminder is due within the last 30 minutes on the current day.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an authentication context using Internet Identity, handling login, stored identities, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on user profiles, reminders, and wellness logs using the backend actor.",
  "frontend/src/index.css": "Sets up Tailwind base styles and theme variables for light and dark modes with custom color tokens.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider, rendering the main App component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters, supporting both query strings and hash routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom colors, extended theme settings, animations, and typography/container/animate plugins.",
  "project_state.json": "Defines project state metadata and lists existing features for an ICP wellness/fitness app including auth, dashboard, logs, reminders, progress, layout, and build tooling."
}